In [0]:
import requests
res = requests.get('https://news.ltn.com.tw/list/breakingnews')

In [2]:
res

In [0]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text,'lxml')

In [0]:
newsary = []
for li in soup.select('ul.list li'):
  #print(li)
  title = li.select_one('.title').text
  dt = li.select_one('.time').text
  link = li.select_one('a').get('href')
  newsary.append({'title':title, 'time': dt, 'link':link})

In [16]:
import pandas
newsdf = pandas.DataFrame(newsary)
newsdf.head()

                       title  ...                                               link
0                5/9重要財經新聞一覽  ...  https://ec.ltn.com.tw/article/breakingnews/315...
1  台灣史前館開館19年首次大改造  本月底封館到明年  ...  https://news.ltn.com.tw/news/life/breakingnews...
2  「我不是股神的粉絲」馬斯克：巴菲特的工作真的很無聊  ...  https://ec.ltn.com.tw/article/breakingnews/315...
3   武漢肺炎疫情任務  學者：中國解放軍發揮兵力有限  ...  https://news.ltn.com.tw/news/world/breakingnew...
4  今晴朗炎熱！明晚梅雨季首道鋒面到 全台嚴防劇烈天氣  ...  https://news.ltn.com.tw/news/life/breakingnews...

[5 rows x 3 columns]

## 自由時報爬蟲

In [0]:
import requests
res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/4')

In [0]:
jd = res.json()

In [0]:
import pandas
df = pandas.DataFrame(jd['data'].values())
#df

In [0]:
import time
newsary = []

for i in range(2,5):
  res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/{}'.format(i))
  time.sleep(2)
  #print(res.json())
  jd = res.json()
  df = pandas.DataFrame(jd['data'].values())
  newsary.append(df)

In [0]:
newsdf = pandas.concat(newsary)

In [118]:
newsdf.head()

        no                                title  ... style tagText
0  3159956             投票日為立委候選人發簡訊拉票 男子恐被罰50萬元  ...  None      社會
1  3159955          罷韓團體深夜「洗地板」 高市府：清潔同仁維護市容很辛苦  ...  None      政治
2  3159953           中國助藍營、韓國瑜賄選案 陸委會：不適用「反滲透法」  ...  None      政治
3  3159926       軍情動態》軍用無人機也能用租的！希臘向以色列租用多架防禦邊境  ...  None      國際
4    40346  今年第一季手機銷售排行 Top 10 出爐！Android 旗艦全陣亡  ...  None      3C

[5 rows x 17 columns]

## Numpy

In [0]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [19]:
for i in range(len(a)):
  print(a[i] * b[i])

2
12
30
56
90

In [20]:
for rec in zip(a,b):
  print(rec)

(1, 2)
(3, 4)
(5, 6)
(7, 8)
(9, 10)

In [21]:
for i,j in zip(a,b):
  print(i*j)

2
12
30
56
90

In [0]:
import numpy

In [0]:
na = numpy.array(a)
nb = numpy.array(b)

In [24]:
na * nb

array([ 2, 12, 30, 56, 90])

In [0]:
import numpy as np
my_list = [1,2,3]
np_my_list = np.array(my_list)

In [26]:
type(my_list)

list

In [27]:
type(np_my_list)

numpy.ndarray

In [28]:
my_list.append(4)
my_list

[1, 2, 3, 4]

In [29]:
np_my_list.append(4)

AttributeError: ignored

In [30]:
my_matrix =[[1,2,3],[4,5,6],[7,8,9]]
np.array(my_matrix)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [32]:
np.arange(0,10)
np.arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [36]:
np.zeros(3)
np.zeros((5,5))
np.ones(3)
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [39]:
np.linspace(0,10,3)
#np.linspace(0,10,50)

array([ 0.,  5., 10.])

In [40]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [46]:
np.random.rand(2)
np.random.rand(5,5)
np.random.randn(2)
np.random.randn(5,5)
np.random.randint(1,100)
np.random.randint(1,42,6)

array([14,  2, 28,  1, 38, 24])

In [49]:
arr = np.arange(25)
arr
arr.reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [0]:
ranarr =np.random.randint(0,50,10)

In [55]:
ranarr

array([41,  6,  8, 15,  4,  3, 41, 28, 39, 11])

In [59]:
ranarr.max()
ranarr.argmax()
ranarr.min()
ranarr.argmin()

5

In [60]:
arr.shape

(25,)

In [61]:
arr.reshape(1,25)

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24]])

In [62]:
arr.reshape(1,25).shape

(1, 25)

In [63]:
arr.reshape(25,1)
arr.reshape(25,1).shape

(25, 1)

In [64]:
arr.dtype

dtype('int64')

In [66]:
arr = np.arange(0,11)
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [68]:
arr[8]
arr[1:5]

array([1, 2, 3, 4])

In [70]:
arr = np.arange(0,11)
slice_of_arr = arr[0:6]
slice_of_arr

array([0, 1, 2, 3, 4, 5])

In [0]:
slice_of_arr[:]=99

In [72]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [73]:
arr_2d = np.array(([5,10,15],[20,25,30],[35,40,45]))
arr_2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [74]:
arr_2d[1]

array([20, 25, 30])

In [75]:
arr_2d[1][0]

20

In [76]:
arr_2d[1,0]

20

In [77]:
arr_2d[2]

array([35, 40, 45])

In [78]:
arr_2d[2,:]

array([35, 40, 45])

In [80]:
arr = np.arange(1,11)
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [83]:
arr > 4
bool_arr = arr>4
bool_arr

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [84]:
arr[bool_arr]

array([ 5,  6,  7,  8,  9, 10])

In [0]:
arr = np.arange(0,10)

In [91]:
arr + arr
arr * arr
arr - arr
arr/arr
1/arr
arr**3

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: RuntimeWarning: invalid value encountered in true_divide
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in true_divide
  """

array([  0,   1,   8,  27,  64, 125, 216, 343, 512, 729])

In [96]:
np.sqrt(arr)
np.exp(arr)
np.max(arr)
np.sin(arr)
np.log(arr)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in log
  """

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

In [97]:
x = np.array([1,2,3,4])
w1 = np.random.randn(4,5)
w1

array([[-1.52107409, -0.02094996, -0.60103684, -1.43694666, -0.24985876],
       [-1.27630083, -1.18650098, -0.40011362, -0.72616762,  0.41418953],
       [ 0.57777188, -0.05149915,  0.90496268,  0.89425989, -2.01482075],
       [ 0.3847239 , -1.94383445,  0.97267206, -1.45304797, -0.46475448]])

In [98]:
np.dot(x,w1)

array([ -0.80146449, -10.32378719,   5.2043122 ,  -6.0186941 ,
        -7.3249599 ])

In [0]:
w2 = np.random.randn(5,3)

In [100]:
np.dot(np.dot(x,w1),w2)

array([-5.80383553, 28.10312297, -3.63173805])

## Pandas

In [0]:
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',35], 
               ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [120]:
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [121]:
na[:,2]

array(['29', '23', '35', '33', '21', '20'], dtype='<U5')

In [123]:
na[:,2].astype(int).mean()

26.833333333333332

In [0]:
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [125]:
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

In [128]:
na[1:,2].astype(int).mean()

26.833333333333332

In [131]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
                    ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
#print(df)
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [132]:
df.columns=['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

## Pandas Series

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels = ['a','b','c']
my_list = [10,20,30]

In [135]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [136]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [0]:
s = pd.Series(my_list,labels)

In [139]:
s[0]

10

In [140]:
s['a']

10

In [141]:
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [0]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA','Germany','Italy', 'Japan'])

In [143]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [144]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [145]:
ser1['USA']

1

In [146]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [0]:
# nan: not a number

## Pandas DataFrame

In [148]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted','M', 33],
                   ['jean', 'F', 21], ['lisa', 'F', 20]], columns = ['name', 'gender', 'age'])

In [0]:
df = pd.DataFrame([{'name':'frank','gender':'M', 'age':29}, 
{'name':'mary','gender':'F', 'age':23}, 
{'name':'tom','gender':'M', 'age':35}, 
{'name':'ted','gender':'M', 'age':33}, 
{'name':'jean','gender':'F', 'age':21}, 
{'name':'lisa','gender':'F', 'age':20}])

In [0]:
df = pd.DataFrame([{'name': 'qoo', 'age':12, 'gender':'M'}, 
 {'name': 'Mary', 'gender': 'F'}])

In [152]:
df

   name   age gender
0   qoo  12.0      M
1  Mary   NaN      F

In [0]:
df = pd.DataFrame([{'name':'frank','gender':'M', 'age':29}, 
{'name':'mary','gender':'F', 'age':23}, 
{'name':'tom','gender':'M', 'age':35}, 
{'name':'ted','gender':'M', 'age':33}, 
{'name':'jean','gender':'F', 'age':21}, 
{'name':'lisa','gender':'F', 'age':20}])

In [155]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [157]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   gender  6 non-null      object
 2   age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [159]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [160]:
df.dtypes

name      object
gender    object
age        int64
dtype: object

In [161]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [162]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [163]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [164]:
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [165]:
df[(df['gender'] == 'M') & (df['age'] >= 30) ]

  name gender  age
2  tom      M   35
3  ted      M   33

In [166]:
df[(df['gender'] == 'M') | (df['age'] >= 30) ]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [0]:
df['employee']= True

In [168]:
df.head()

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True

In [0]:
del df['employee']

In [170]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [171]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [173]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20

In [174]:
pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),

(   age gender name
 0   20      F  qoo,)

In [175]:
df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),
ignore_index=True)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20
6    qoo      F   20
7    qoo      F   20

In [0]:
df.drop(6, axis = 0, inplace=True)

In [179]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [0]:
df['userid'] = range(101,107)

In [181]:
df

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103
3    ted      M   33     104
4   jean      F   21     105
5   lisa      F   20     106

In [0]:
df.set_index('userid', inplace=True)

In [183]:
df

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21
106      lisa      F   20

In [184]:
# iloc: by 位置
df.iloc[1]

name      mary
gender       F
age         23
Name: 102, dtype: object

In [185]:
df.iloc[[1,3,5]]

        name gender  age
userid
102     mary      F   23
104      ted      M   33
106     lisa      F   20

In [186]:
# loc: by 索引
df.loc[103]

name      tom
gender      M
age        35
Name: 103, dtype: object

In [187]:
df.loc[[103,105], ['name', 'age']]

        name  age
userid
103      tom   35
105     jean   21

In [188]:
df.iloc[[2,4], [0, 2]]

        name  age
userid
103      tom   35
105     jean   21

## 小任務
-　現在有三個客戶 David, Mary, John 購買了台積電的股票

- David 的購買價格是200, 賣出價格是 250
- Mary 的購買價格是 300, 賣出價格是 325
- John 的購買價格是 300, 賣出價格是270

- 請協助我將他們的名字, 購買價, 賣出價 建立一DataFrame df 並從中計算 每個人的投資報酬率, 最後篩選出有正報酬的投資者?